# TopCutHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionConcreteRectangleCut..::..TopCutHeight Property
StructuralSectionConcreteRectangleCut Class See Also
---
Section height right Cut.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double TopCutHeight { get; set; }
```

Visual Basic
---
```text
Public Property TopCutHeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TopCutHeight {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace